In [1]:
import pandas as pd
import json

In [6]:
df = pd.read_csv('./raw/starnames.cn.csv', header=0,
                 index_col=0, usecols=['id', 'name'])
df.head()

      name
id
43    王良增九
124   王良增十
145   垒壁阵十
154  垒壁阵十二
171   壁宿增五

In [7]:
df = df[~df['name'].str.contains('增')]

In [9]:
df.sort_values(by='name')

       name
id
81497   七公一
74666   七公七
79101   七公三
79992   七公二
75973   七公五
...     ...
117089  𫓧钺二
6960    𫓧锧一
7679    𫓧锧二
9061    𫓧锧五
9347    𫓧锧四

[1366 rows x 1 columns]